{"class_name": "Model", "keras_version": "2.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 324], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "ThetaLookupLayer", "config": {"trainable": true, "name": "theta_lookup_layer_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "theta_lookup_layer_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "FLayer", "config": {"activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.99999993922529e-09}}, "trainable": true, "name": "f_layer_1", "kernel_constraint": {"class_name": "NonNeg", "config": {}}}, "inbound_nodes": [[["theta_lookup_layer_1", 0, 0, {}], ["input_3", 0, 0, {}]]], "name": "f_layer_1"}], "input_layers": [["input_1", 0, 0], ["input_3", 0, 0]], "output_layers": [["f_layer_1", 0, 0]], "name": "community_assignment_model"}, "backend": "tensorflow"}