{"class_name": "Model", "keras_version": "2.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4039], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4039], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "ThetaLookupLayer", "config": {"trainable": true, "name": "theta_lookup_layer_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]], "name": "theta_lookup_layer_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_4", "sparse": false}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "FLayer", "config": {"activity_regularizer": null, "trainable": true, "name": "f_layer_1", "kernel_constraint": null}, "inbound_nodes": [[["theta_lookup_layer_1", 0, 0, {}], ["input_3", 0, 0, {}]], [["theta_lookup_layer_1", 1, 0, {}], ["input_4", 0, 0, {}]]], "name": "f_layer_1"}, {"class_name": "PLayer", "config": {"trainable": true, "name": "p_layer_1"}, "inbound_nodes": [[["f_layer_1", 0, 0, {}], ["f_layer_1", 1, 0, {}]]], "name": "p_layer_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Q", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1406, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["f_layer_1", 0, 0, {}]], [["f_layer_1", 1, 0, {}]]], "name": "Q"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["p_layer_1", 0, 0], ["Q", 0, 0], ["Q", 1, 0]], "name": "trainable_model"}, "backend": "tensorflow"}